40 columns                              |
<<< separate by two newlines with docstring
package foo
/**
 * comment
 */
object a
>>>
package foo

/**
  * comment
  */
object a

<<< separate by two newlines
package foo
object a
>>>
package foo
object a
<<< with inline comment
package foo // this package is cool
object a
>>>
package foo // this package is cool
object a
<<< with import
package foo
import a.b
object a
>>>
package foo
import a.b
object a
<<< 2x packages
package foo
package bar
object a
>>>
package foo
package bar
object a

<<< top-level stats have flexible newlines #153
package foo
abstract class Dsl
class A     extends Dsl
class B extends Dsl
>>>
package foo
abstract class Dsl
class A extends Dsl
class B extends Dsl
<<< format comment with single asterisk, SpaceAsterisk
docstrings.style = SpaceAsterisk
===
/** Align by
 * second asterisk.
 *
 */
>>>
/** Align by
  * second asterisk.
  */
<<< format comment with single asterisk, AsteriskSpace
docstrings.style = AsteriskSpace
===
/** Align space by
  * second asterisk.
  *
  */
>>>
/** Align space by
 *  second asterisk.
 */
<<< format comment with single asterisk, Asterisk
docstrings.style = Asterisk
===
/** Align by
  * first asterisk.
  *
  */
>>>
/**
 * Align by
 * first asterisk.
 */
