
<<< trailing comma
foo(
  1,
  2,
)
>>>
foo(
    1,
    2
)
<<< literal types
val x : 42 = 42
>>>
val x: 42 = 42
<<< intersection types
val x : A   &  B = 42
>>>
val x: A & B = 42
<<< class param
class T(a : Int)
>>>
class T(a: Int)
<<< underscore separator
val x =   1_000_000
>>>
val x = 1_000_000
<<< by name implicit
def foo(implicit   x: => Int) = x
>>>
def foo(implicit x: => Int) = x
<<< #2071 given not kw
object Main {
  val given = 42
}
>>>
object Main {
  val given = 42
}
